function solution(letter) {
    const morse = { 
        '.-':'a',
        '-...':'b',
        '-.-.':'c',
        '-..':'d',
        '.':'e',
        '..-.':'f',
        '--.':'g',
        '....':'h',
        '..':'i',
        '.---':'j',
        '-.-':'k',
        '.-..':'l',
        '--':'m',
        '-.':'n',
        '---':'o',
        '.--.':'p',
        '--.-':'q',
        '.-.':'r',
        '...':'s',
        '-':'t',
        '..-':'u',
        '...-':'v',
        '.--':'w',
        '-..-':'x',
        '-.--':'y',
        '--..':'z'
}
    // 편지를 공백 기준 배열로 나눈 후, 순회를 돌면서 해당 부호가 morse 객체의 키 일 경우 해당하는 문자를 반환한다.
    // 순회를 모두 돌고 배열을 문자열로 반환한다.
    return letter.split(" ").map(m => morse[m]).join("")
}